{
    "title": "Software Engineer Intern, Machine Learning (PhD)",
    "company": "Meta",
    "location": "Anywhere",
    "description": "Meta is embarking on the most transformative change to its business and technology in company history, and our Machine Learning teams are at the forefront of this evolution. By taking on crucial projects and initiatives that have never been done before, you have an opportunity to help advance the way people connect around the world. In order to meet the demands of our scale, we approach machine learning challenges from a system engineering standpoint, pushing the boundaries of scalable computing and tying together numerous complex platforms to build models that leverage trillions of actions.\n\nOur research and production implementations leverage many of the innovations being generated from Meta's research in Distributed Computing, Artificial Intelligence and Databases, and run on the same hardware and network specifications that are being open sourced through the Open Compute project. As a PhD intern at Meta, you will help build machine learning systems and models behind Meta's products, create web applications that reach millions of people, build high volume servers and be a part of a team that's working to help connect people around the globe. As part of our hiring process, PhD interns are matched to a relevant team based on their experience and interests.\n\nThis internship has a minimum twelve (12) week duration with 2026 start dates only. Software Engineer Intern, Machine Learning (PhD) Responsibilities Develop highly scalable classifiers and tools leveraging machine learning, regression, and rules-based models Suggest, collect and synthesize requirements and create effective feature roadmap Code deliverables in tandem with the engineering team Adapt standard machine learning methods to best exploit modern parallel environments (e.g. distributed clusters, multicore SMP, and GPU) Perform specific responsibilities which vary by team Minimum Qualifications Currently has, or is in the process of obtaining, a PhD in Computer Science, Computer Vision, Machine Learning, or related field Research and/or work experience in a relevant field, such as machine learning, deep learning, reinforcement learning, NLP, recommendation systems, pattern recognition, signal processing, data mining, artificial intelligence, or computer vision Experience in systems software or algorithms Experience coding in Java, C/C++, Perl, PHP, or Python Interpersonal experience: cross-group and cross-culture collaboration Must obtain work authorization in country of employment at the time of hire, and maintain ongoing work authorization during employment Preferred Qualifications Intent to return to degree-program after the completion of the internship/co-op Demonstrated software engineer experience via an internship, work experience, coding competitions, or PhD papers Proven track record of achieving significant results as demonstrated by grants, fellowships, patents, as well as first-authored publications at leading workshops or conferences Demonstrated creativity and quick problem solving capabilities Experience with Hadoop/Hbase/Pig or Mapreduce/Sawzall/Bigtable For those who live in or expect to work from California if hired for this position, please click here for additional information\n\nAbout Meta Meta builds technologies that help people connect, find communities, and grow businesses. When Facebook launched in 2004, it changed the way people connect. Apps like Messenger, Instagram and WhatsApp further empowered billions around the world.\n\nNow, Meta is moving beyond 2D screens toward immersive experiences like augmented and virtual reality to help build the next evolution in social technology. People who choose to build their careers by building with us at Meta help shape a future that will take us beyond what digital connection makes possible today-beyond the constraints of screens, the limits of distance, and even the rules of physics. $7,313/month to $12,134/month + benefits Individual compensation is determined by skills, qualifications, experience, and location.\n\nCompensation details listed in this posting reflect the base hourly rate, monthly rate, or annual salary only, and do not include bonus, equity or sales incentives, if applicable. In addition to base compensation, Meta offers benefits. Learn more about benefits at Meta.\n\nEqual Employment Opportunity Meta is proud to be an Equal Employment Opportunity employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), sexual orientation, gender identity, gender expression, age, status as a protected veteran, status as an individual with a disability, genetic information, political views or activity, or other applicable legally protected characteristics. You may view our Equal Employment Opportunity notice here.\n\nMeta is committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. If you need assistance or an accommodation due to a disability, fill out the Accommodations request form.",
    "url": "https://www.ziprecruiter.com/c/Meta/Job/Software-Engineer-Intern,-Machine-Learning-(PhD)/-in-New-York,NY?jid=07f64eac064bd3c1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "apply_url": "https://www.ziprecruiter.com/c/Meta/Job/Software-Engineer-Intern,-Machine-Learning-(PhD)/-in-New-York,NY?jid=07f64eac064bd3c1&utm_campaign=google_jobs_apply&utm_source=google_jobs_apply&utm_medium=organic",
    "date_posted": "Recent",
    "platform": "ZipRecruiter",
    "job_type": "Internship",
    "is_real_job": true,
    "date_saved": "2025-10-31 11:29:36"
}